import React from 'react';
import { View, Text } from 'react-native'
import { semanticColors } from './elements';


export default function IssieAbout(props) {
    return <View style={{ backgroundColor: semanticColors.mainAreaBG, height:'100%', width:'100%' }}>
        <Text style={{ fontSize: 18, color: 'black', textAlign: 'right' }}>
            בית איזי שפירא לשינוי באיכות חייהם של אנשים עם מוגבלויות, הינו ארגון פורץ דרך הפועל למעלה מ-39 שנים, משפיע על חייהם של כחצי מיליון בוגרים וילדים בשנה ומהווה מודל לעשייה בתחום הן במישור הארצי והן בזה הבינלאומי.
    
    הארגון נוסד לזכרו של איזי שפירא ז”ל ובהמשך לדרכו ולפילוסופית החיים שלו כי “לכל אדם הזכות לחיות בכבוד ובהתאם למלוא יכולותיו”.
    
הארגון פועל כדי להבטיח לאנשים עם מוגבלויות שותפות מלאה בחיי הקהילה ואיכות חיים טובה יותר, כאשר כל אדם עם מוגבלות הינו אזרח שווה זכויות, מעורב ופעיל בחיי הקהילה. זאת על ידי מתן ופיתוח שירותים חינוכיים טיפוליים חדשניים, פעילות רחבה ליצירת שינוי עמדות חברתי והפעלת מרכז למצוינות, מחקר והכשרה מקצועית בתחום המוגבלויות.        </Text>
    </View>
}